[
    {
        "name": "Abstract Strategy",
        "description": "Games with minimal luck and no hidden information, focusing purely on player strategy and tactics."
    },
    {
        "name": "Area Control",
        "description": "Players compete to dominate specific areas on the board, often through strategic placement or combat."
    },
    {
        "name": "Campaign/Legacy",
        "description": "Games that evolve over multiple sessions, with changes carrying over from game to game."
    },
    {
        "name": "Deckbuilding",
        "description": "Players build a deck of cards during gameplay to gain more powerful combinations and abilities."
    },
    {
        "name": "Dungeon Crawler",
        "description": "Players explore maps, fight monsters, and gather loot, often in a fantasy setting."
    },
    {
        "name": "Worker Placement",
        "description": "Players place workers on limited action spaces to gain resources or perform tasks."
    },
    {
        "name": "Tile Placement",
        "description": "Players place tiles to build or expand a map or territory in strategic ways."
    },
    {
        "name": "Economic",
        "description": "Games focused on money management, markets, and resource optimization."
    },
    {
        "name": "Engine Building",
        "description": "Players develop combinations of components that generate increasing returns over time."
    },
    {
        "name": "Memory",
        "description": "Games that challenge players to remember previously revealed or hidden information."
    },
    {
        "name": "Party Games",
        "description": "Games designed for large groups, emphasizing fun, interaction, and humor over strategy."
    },
    {
        "name": "Family Games",
        "description": "Accessible games suitable for all ages, often easy to learn and quick to play."
    },
    {
        "name": "Word Games",
        "description": "Games that involve vocabulary, spelling, or wordplay as core mechanics."
    },
    {
        "name": "Real-Time",
        "description": "Games where players act simultaneously or under time pressure without turns."
    },
    {
        "name": "Push Your Luck",
        "description": "Players decide how far to push their advantage, risking loss for greater reward."
    },
    {
        "name": "Adventure",
        "description": "Narrative-driven games where players explore, encounter events, and progress through a story."
    },
    {
        "name": "Horror",
        "description": "Games designed to evoke fear, suspense, or survival themes, often with dramatic tension."
    },
    {
        "name": "Asymmetric",
        "description": "Players have different abilities, roles, or objectives, often creating uneven starting positions."
    },
    {
        "name": "Cooperative",
        "description": "Players work together toward a shared goal, winning or losing as a team."
    },
    {
        "name": "Science Fiction",
        "description": "Games set in futuristic or space-based settings, often involving technology or interstellar conflict."
    },
    {
        "name": "Fantasy",
        "description": "Games set in magical or mythical worlds with fantastical creatures or powers."
    },
    {
        "name": "Historical",
        "description": "Games based on or inspired by real historical events, settings, or figures."
    },
    {
        "name": "Wargame",
        "description": "Games focused on military conflict, tactics, and battlefield control."
    },
    {
        "name": "4X",
        "description": "Games that involve exploring, expanding, exploiting, and exterminating, often in a large map or galaxy."
    },
    {
        "name": "Negotiation",
        "description": "Games where players must bargain, trade, or make deals with each other to achieve their goals."
    },
    {
        "name": "Card Game",
        "description": "Games primarily played with cards as the main component, often involving hand management."
    },
  {
  "name": "Miniatures",
  "description": "Games centered around painted or unpainted miniature figures, often involving measuring movement and detailed combat on terrain-based maps."
},
{
  "name": "Trivia",
  "description": "Games that challenge players’ knowledge of facts and general information, typically through questions and answers."
},
{
  "name": "Social",
  "description": "Games driven by conversation, personality, or improvisation, often emphasizing interaction over traditional mechanics."
}